# WallStructuralSignificant Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallStructuralSignificant Property
ParameterTypeId Class See Also
---
"Structural"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallStructuralSignificant { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallStructuralSignificant As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallStructuralSignificant {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace